---
kind: property
id: P:Autodesk.Revit.DB.Visual.SolidGlass.SolidglassGlossiness
source: html/f48b3938-ffd3-75ac-aae9-ecca5979bda0.htm
---
# Autodesk.Revit.DB.Visual.SolidGlass.SolidglassGlossiness Property

The property labeled "Roughness" from the "SolidGlass" schema.

## Syntax (C#)
```csharp
public static string SolidglassGlossiness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".